<?php


//========================================
//　SEOタグ取得
//========================================

function seo_meta_set(){

	global $page, $paged ,$wp_query;


	// --------------------------------------------------------------------
	// １．デフォルト設定 
	// --------------------------------------------------------------------
	$default_meta['title']            = get_the_title()."｜ YCAT（ワイキャット）横浜シティ・エア・ターミナル - Yokohama City Air terminal -";
	$default_meta['meta_description'] = get_the_title()." - YCAT（横浜シティ・エア・ターミナル）のオフィシャルページ。横浜と羽田空港・成田空港を結ぶバスターミナル。東扇島線、お台場線、葉山・横須賀西部地域、八景島シーパラダイス線、幕張メッセ線（イベント限定）、都市間を結ぶ高速バスも発着。横浜・神奈川のお土産の販売。";
	$default_meta['meta_keywords']    = get_the_title().",YCAT,ワイキャット";


	// --------------------------------------------------------------------
	// ２．デフォルト設定を使用するか、デフォルト設定を使用するか
	//
	// ここは自動処理されます
	//
	// 各ページの値にACFの値が設定されていればACFを優先
	// タイトル、description、keywrods個別での設定OK
	//
	//
	// --------------------------------------------------------------------
	$meta['tag_title']            = trim(get_field("tag_title"))            != "" ? get_field("tag_title")            : $default_meta['title'] ;
	$meta['tag_meta_description'] = trim(get_field("tag_meta_description")) != "" ? get_field("tag_meta_description") : $default_meta['meta_description'] ;
	$meta['tag_meta_keywords']    = trim(get_field("tag_meta_keywords"))    != "" ? get_field("tag_meta_keywords")    : $default_meta['meta_keywords'] ;





	// ■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
	//
	// 【ACFが使用できない】その他のページの meta タグ設定 ▽▽▽▽▽▽▽▽
	//
	// ■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■



	// -----------------------------------
	// ● ==> フロントページ（TOPページ）
	// -----------------------------------
	if(is_front_page()){
		// ※TOPページのSEO設定で上書き可能なため設定不要


	// -----------------------------------
	// ● ==> ブログトップページ
	// -----------------------------------
	} elseif( is_home()){


	// -----------------------------------
	// ● ==> 404ページ
	// -----------------------------------
	} elseif(is_404()){
		$meta['tag_title']            = '404 Not Found - ページが見つかりません' ;
		$meta['tag_meta_description'] = "アクセスしようとしたページが見つかりません。ご覧になっていたページからのリンクに問題があるか、ご入力いただいたアドレス（URL）がタイプミスなどで間違っている可能性があります。";
		$meta['tag_meta_keywords']    = "404";


	// -----------------------------------
	// ● ==> 固定ページ
	// -----------------------------------
	} elseif(is_page()) {
		// ※各固定ページのSEO設定で上書き可能なため設定不要


	// -----------------------------------
	// ● ==> 検索結果ページ
	// -----------------------------------
	} elseif(is_search()){
		$meta['tag_title']            = '検索結果' ;
		$meta['tag_meta_description'] = "検索結果";
		$meta['tag_meta_keywords']    = "検索結果";


	// -----------------------------------
	// ● ==> アーカイブページ関連
	// -----------------------------------
	} elseif(is_archive()){

		$cat_title = single_cat_title('',false); //　カテゴリー名の取得
		$tag       = get_queried_object(); // タグのスラッグ名を取得

		// よくある質問一覧
		if(is_post_type_archive('faq')){
			$meta['tag_title']            = 'よくある質問 - ｜ YCAT（ワイキャット）横浜シティ・エア・ターミナル - Yokohama City Air terminal -';
			$meta['tag_meta_description'] = "よくある質問 - YCAT（横浜シティ・エア・ターミナル）のオフィシャルページ。横浜と羽田空港・成田空港を結ぶバスターミナル。東扇島線、お台場線、葉山・横須賀西部地域、八景島シーパラダイス線、幕張メッセ線（イベント限定）、都市間を結ぶ高速バスも発着。横浜・神奈川のお土産の販売。";
			$meta['tag_meta_keywords']    = "よくある質問,YCAT,ワイキャット";
		}

		// バス路線案内
		if(is_post_type_archive('route')){
			$meta['tag_title']            = 'バス路線案内 - ｜ YCAT（ワイキャット）横浜シティ・エア・ターミナル - Yokohama City Air terminal -';
			$meta['tag_meta_description'] = "バス路線案内 - YCAT（横浜シティ・エア・ターミナル）のオフィシャルページ。横浜と羽田空港・成田空港を結ぶバスターミナル。東扇島線、お台場線、葉山・横須賀西部地域、八景島シーパラダイス線、幕張メッセ線（イベント限定）、都市間を結ぶ高速バスも発着。横浜・神奈川のお土産の販売。";
			$meta['tag_meta_keywords']    = "バス路線案内,YCAT,ワイキャット";
		}

		// インフォメーション
		if(is_post_type_archive('info')){
			$meta['tag_title']            = 'インフォメーション - ｜ YCAT（ワイキャット）横浜シティ・エア・ターミナル - Yokohama City Air terminal -';
			$meta['tag_meta_description'] = "インフォメーション - YCAT（横浜シティ・エア・ターミナル）のオフィシャルページ。横浜と羽田空港・成田空港を結ぶバスターミナル。東扇島線、お台場線、葉山・横須賀西部地域、八景島シーパラダイス線、幕張メッセ線（イベント限定）、都市間を結ぶ高速バスも発着。横浜・神奈川のお土産の販売。";
			$meta['tag_meta_keywords']    = "インフォメーション,YCAT,ワイキャット";
		}


	// -----------------------------------
	// カスタム投稿のシングルページ（買取実績）
	// -----------------------------------
	} elseif(is_singular()) {

		// ■ シングルページ（いわゆるPOST - 投稿）
		if(is_singular('post')){
			$meta['tag_title'] .= ' ['.get_the_time('Y年m月d日')."]";
		} else {

		}

		if(is_singular('xxxxxx')) {
		}		

	// -----------------------------------
	// ● ==> フロント・ブログトップページ以外
	// -----------------------------------
	} else {

	}

	// -----------------------------------
	// ● ==> ページネーションが発生した場合
	// -----------------------------------
	if ( $paged >= 2 || $page >= 2 ){
		//ページ番号を付与
		$meta['tag_title'] .= ' | ' . sprintf( __( 'Page %s', 'twentyten' ), max( $paged, $page ) );
	}
	//========================================

	return $meta;

}
